DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
#include <Arduino.h>
#include <DNSServer.h>
#include <EEPROM.h>
#include <ESP8266mDNS.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <LittleFS.h>
#include <Updater.h>

#include "../../firmware_shared/app_runtime.h"
#include "../../firmware_shared/app_transport.h"
#include "renderer_esp8266.h"

#ifndef CODEXBAR_DISPLAY_BOARD_ID
#define CODEXBAR_DISPLAY_BOARD_ID "esp8266-unknown"
#endif

#ifndef CODEXBAR_DISPLAY_FW_VERSION
#define CODEXBAR_DISPLAY_FW_VERSION "dev"
#endif

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
const char kThemeFeatureJSON[] = "[\"theme\",\"theme-spec-v1\"]";
#else
const char kThemeFeatureJSON[] = "[\"theme\"]";
#endif

namespace {

codexbar_display::app::RuntimeContext runtimeCtx;
codexbar_display::esp8266::RendererESP8266 renderer;
ESP8266WebServer webServer(80);
DNSServer dnsServer;

constexpr int kMaxFrameBytes = 2048;
constexpr uint16_t kDnsPort = 53;
constexpr uint32_t kWifiCredsMagic = 0x56544231UL;  // VTB1
constexpr uint32_t kBootRecoveryMagic = 0x56544252UL;  // VTBR
constexpr size_t kWifiSsidBytes = 33;
constexpr size_t kWifiPasswordBytes = 65;
constexpr size_t kWifiCredsBytes = 4 + kWifiSsidBytes + kWifiPasswordBytes;
constexpr size_t kBootRecoveryOffset = kWifiCredsBytes;
constexpr size_t kBootRecoveryBytes = 5;
constexpr size_t kEepromBytes = kWifiCredsBytes + kBootRecoveryBytes;
constexpr unsigned long kWifiConnectTimeoutMs = 20000UL;
constexpr unsigned long kWifiReconnectRetryMs = 5000UL;
constexpr unsigned long kWifiReconnectFallbackMs = 120000UL;
constexpr unsigned long kRebootDelayMs = 750UL;
constexpr unsigned long kBootRecoveryStableMs = 30000UL;
constexpr unsigned long kFrameStaleWarningMs = 150000UL;
constexpr unsigned long kFirmwareUpdateNoticeToggleMs = 1500UL;
constexpr uint8_t kBootRecoveryThreshold = 3;
constexpr size_t kMaxAssetPathBytes = 32;
constexpr size_t kMaxStoredThemeSpecBytes = 4096;
const char kSetupApSsid[] = "VibeTV-Setup";
const char kSetupHost[] = "vibetv.local";
const char kMdnsName[] = "vibetv";
const char kMdnsHost[] = "vibetv.local";
const char kFirmwareManifestUrl[] = "https://github.com/DreamyTalesPAN/CodexBar-Display/releases/latest/download/firmware-manifest.json";
const char* const kFirmwareUpdateNoticeTexts[] = {
    "Update Available:",
    "vibetv.local",
};
constexpr uint8_t kFirmwareUpdateNoticeTextCount =
    sizeof(kFirmwareUpdateNoticeTexts) / sizeof(kFirmwareUpdateNoticeTexts[0]);

struct WifiCredentials {
  char ssid[kWifiSsidBytes] = {0};
  char password[kWifiPasswordBytes] = {0};
};

struct FirmwareUpdateState {
  bool available = false;
  String latestVersion;
  String lastStatus = "disabled";
  String lastError;
  unsigned long lastCheckedAtMs = 0;
  unsigned long nextCheckAtMs = 0;
  bool noticeVisible = false;
  uint8_t noticePhase = 0;
  unsigned long noticeLastToggleAtMs = 0;
};

struct OtaUploadDiagnostics {
  const char* target = "none";
  const char* status = "idle";
  String filename;
  String lastError;
  int command = -1;
  size_t contentLength = 0;
  size_t totalSize = 0;
  size_t maxSize = 0;
  size_t freeSketchSpace = 0;
  uint8_t updateError = UPDATE_ERROR_OK;
  unsigned long startedAtMs = 0;
  unsigned long endedAtMs = 0;
  unsigned long successCount = 0;
  unsigned long failureCount = 0;
};

struct RuntimeRenderDiagnostics {
  unsigned long fullCount = 0;
  unsigned long partialCount = 0;
  unsigned long animatedTickAttempts = 0;
  const char* lastKind = "none";
  unsigned long lastDurationUs = 0;
  unsigned long lastAtMs = 0;
};

bool httpServerStarted = false;
bool setupMode = false;
bool waitStatusRendered = false;
bool otaUploadSucceeded = false;
bool otaUploadInProgress = false;
String otaUploadError;
bool assetUploadSucceeded = false;
String assetUploadError;
String assetUploadPath;
String activeThemeSpecPath;
String activeThemeSpecHash;
String setupWifiOptionsHTML;
bool rebootPending = false;
unsigned long rebootAtMs = 0;
bool bootRecoveryCounterNeedsClear = false;
unsigned long bootRecoveryClearAtMs = 0;
unsigned long lastFrameAcceptedAtMs = 0;
bool frameStaleStatusRendered = false;
bool captiveDnsStarted = false;
bool mdnsStarted = false;
unsigned long wifiDisconnectedAtMs = 0;
unsigned long wifiReconnectAttemptAtMs = 0;
bool wifiReconnectStatusRendered = false;
FirmwareUpdateState firmwareUpdate;
bool firmwareUpdateTopLineDirty = false;
OtaUploadDiagnostics otaDiagnostics;
RuntimeRenderDiagnostics renderDiagnostics;

void recordRenderFull(const char* kind, unsigned long durationUs) {
  renderDiagnostics.fullCount++;
  renderDiagnostics.lastKind = kind;
  renderDiagnostics.lastDurationUs = durationUs;
  renderDiagnostics.lastAtMs = millis();
}

void recordRenderPartial(const char* kind, unsigned long durationUs) {
  renderDiagnostics.partialCount++;
  renderDiagnostics.lastKind = kind;
  renderDiagnostics.lastDurationUs = durationUs;
  renderDiagnostics.lastAtMs = millis();
}

void recordAnimatedTickAttempt() {
  renderDiagnostics.animatedTickAttempts++;
}

String jsonEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length() + 8);
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

uint32_t fnv1a32(const String& raw) {
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < raw.length(); ++i) {
    hash ^= static_cast<uint8_t>(raw[i]);
    hash *= 16777619UL;
  }
  return hash;
}

String hashHex8(const String& raw) {
  String out = String(fnv1a32(raw), HEX);
  while (out.length() < 8) {
    out = "0" + out;
  }
  return out;
}

void appendJSONNullableString(String& out, const String& value) {
  if (value.length() == 0) {
    out += "null";
    return;
  }
  out += "\"";
  out += jsonEscape(value);
  out += "\"";
}

