DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void markFirmwareUpdateNoticeDirty() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  if (!runtimeCtx.screenDirty && !waitStatusRendered && !frameStaleStatusRendered) {
    firmwareUpdateTopLineDirty = true;
  } else {
    runtimeCtx.screenDirty = true;
  }
}

void applyFirmwareUpdateNoticePhase() {
  if (firmwareUpdate.noticePhase == 0 ||
      firmwareUpdate.noticePhase > kFirmwareUpdateNoticeTextCount) {
    runtimeCtx.topLineOverride = "";
    firmwareUpdate.noticeVisible = false;
    firmwareUpdate.noticePhase = 0;
    return;
  }
  runtimeCtx.topLineOverride = kFirmwareUpdateNoticeTexts[firmwareUpdate.noticePhase - 1];
  firmwareUpdate.noticeVisible = true;
}

void clearFirmwareUpdateNotice() {
  if (runtimeCtx.topLineOverride.length() == 0 && !firmwareUpdate.noticeVisible) {
    return;
  }
  runtimeCtx.topLineOverride = "";
  firmwareUpdate.noticeVisible = false;
  firmwareUpdate.noticePhase = 0;
  firmwareUpdate.noticeLastToggleAtMs = millis();
  markFirmwareUpdateNoticeDirty();
}

void maintainFirmwareUpdateNotice() {
  if (!firmwareUpdate.available ||
      setupMode ||
      frameStaleStatusRendered ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
    clearFirmwareUpdateNotice();
    return;
  }

  const unsigned long nowMs = millis();
  if (firmwareUpdate.noticeLastToggleAtMs == 0) {
    firmwareUpdate.noticeLastToggleAtMs = nowMs;
    return;
  }
  if ((nowMs - firmwareUpdate.noticeLastToggleAtMs) < kFirmwareUpdateNoticeToggleMs) {
    return;
  }

  firmwareUpdate.noticeLastToggleAtMs = nowMs;
  firmwareUpdate.noticePhase =
      (firmwareUpdate.noticePhase + 1) % (kFirmwareUpdateNoticeTextCount + 1);
  applyFirmwareUpdateNoticePhase();
  markFirmwareUpdateNoticeDirty();
}

void applyFrameUpdateState() {
  if (!codexbar_display::app::HasFrame(runtimeCtx)) {
    return;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (!frame.hasUpdateAvailable) {
    return;
  }

  String nextStatus = frame.updateStatus;
  if (nextStatus.length() == 0) {
    nextStatus = frame.updateAvailable ? "update_available" : "current";
  }
  const bool changed = firmwareUpdate.available != frame.updateAvailable ||
                       firmwareUpdate.latestVersion != frame.updateLatestVersion ||
                       firmwareUpdate.lastStatus != nextStatus ||
                       firmwareUpdate.lastError != frame.updateLastError;
  firmwareUpdate.available = frame.updateAvailable;
  firmwareUpdate.latestVersion = frame.updateLatestVersion;
  firmwareUpdate.lastError = frame.updateLastError;
  firmwareUpdate.lastCheckedAtMs = millis();
  firmwareUpdate.nextCheckAtMs = 0;
  firmwareUpdate.lastStatus = nextStatus;

  if (!firmwareUpdate.available) {
    clearFirmwareUpdateNotice();
    return;
  }
  if (frame.hasThemeSpec) {
    clearFirmwareUpdateNotice();
    return;
  }
  if (changed) {
    firmwareUpdate.noticeVisible = true;
    firmwareUpdate.noticePhase = 1;
    firmwareUpdate.noticeLastToggleAtMs = millis();
    applyFirmwareUpdateNoticePhase();
    runtimeCtx.screenDirty = true;
  }
}

void drawWaitingForCompanionStatus() {
  const unsigned long renderStartUs = micros();
  renderer.DrawConnectedSetupInstructions(runtimeCtx, kMdnsHost, WiFi.localIP().toString());
  recordRenderFull("connected_setup", micros() - renderStartUs);
  waitStatusRendered = true;
}

void drawWifiConnectingStatus(const String& ssid) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Connecting WiFi", ssid);
  recordRenderFull("status", micros() - renderStartUs);
}

void drawWifiResetStatus(const String& line2) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV RESET", "WiFi reset", line2);
  recordRenderFull("status", micros() - renderStartUs);
}

void drawUpdateStatus(const String& line2) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV UPDATE", "Update running", line2);
  recordRenderFull("update_status", micros() - renderStartUs);
}

bool statusScreenLocked() {
  return otaUploadInProgress || rebootPending;
}

void resetWifiReconnectState() {
  wifiDisconnectedAtMs = 0;
  wifiReconnectAttemptAtMs = 0;
  wifiReconnectStatusRendered = false;
}

void startMdnsResponder(const IPAddress& address) {
  if (mdnsStarted) {
    return;
  }
  if (!MDNS.begin(kMdnsName, address)) {
    Serial.printf("mdns_start_failed host=%s ip=%s\n", kMdnsHost, address.toString().c_str());
    return;
  }
  MDNS.addService("http", "tcp", 80);
  mdnsStarted = true;
  Serial.printf("mdns_started host=%s ip=%s service=http\n", kMdnsHost, address.toString().c_str());
}

String displayErrorMessage(const String& message) {
  if (message == "runtime/codexbar-version" || message == "runtime/codexbar-parse") {
    return "Update Mac App";
  }
  if (message == "runtime/codexbar-binary") {
    return "Install Mac App";
  }
  if (message == "runtime/no-providers") {
    return "Open Mac App";
  }
  if (message == "runtime/codexbar-cmd") {
    return "Check Mac App";
  }
  if (message == "runtime/cycle-timeout") {
    return "Check Mac App";
  }
  return "Check Mac App";
}

void markFrameAccepted(const codexbar_display::core::SerialConsumeEvent& event, const char* transport) {
  if (statusScreenLocked()) {
    Serial.printf("frame_ignored transport=%s reason=status_screen_locked\n", transport);
    return;
  }

  const bool redrawAfterStaleStatus = frameStaleStatusRendered;
  waitStatusRendered = false;
  frameStaleStatusRendered = false;
  lastFrameAcceptedAtMs = millis();
  applyFrameUpdateState();
  if (event.themeSpecChanged) {
    if (codexbar_display::app::HasFrame(runtimeCtx) &&
        codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
      const String& raw = codexbar_display::app::CurrentFrame(runtimeCtx).themeSpecRaw;
      if (raw.length() > 0) {
        activeThemeSpecHash = hashHex8(raw);
      }
    } else {
      activeThemeSpecPath = "";
      activeThemeSpecHash = "";
    }
  }
  renderer.OnFrameAccepted(runtimeCtx, event);
  if (redrawAfterStaleStatus) {
    runtimeCtx.screenDirty = true;
  }
  Serial.printf("frame_received transport=%s\n", transport);
}

const char* transportCapabilitiesJSON(const char* activeTransport) {
  const bool isUsb = activeTransport != nullptr && strcmp(activeTransport, "usb") == 0;
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  if (isUsb) {
    return "{\"display\":{\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16},"
           "\"theme\":{\"supportsThemeSpecV1\":false,\"maxThemeSpecBytes\":0,\"maxThemePrimitives\":0},"
           "\"transport\":{\"active\":\"usb\",\"supported\":[\"usb\",\"wifi\"]}}";
  }
  return "{\"display\":{\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16},"
         "\"theme\":{\"supportsThemeSpecV1\":false,\"maxThemeSpecBytes\":0,\"maxThemePrimitives\":0},"
         "\"transport\":{\"active\":\"wifi\",\"supported\":[\"usb\",\"wifi\"]}}";
#else
  if (isUsb) {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
    return "{\"display\":{\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16},"
           "\"theme\":{\"supportsThemeSpecV1\":true,\"maxThemeSpecBytes\":2048,\"maxThemePrimitives\":32,\"supportsStoredThemes\":true,\"maxStoredThemeSpecBytes\":4096},"
           "\"transport\":{\"active\":\"usb\",\"supported\":[\"usb\",\"wifi\"]}}";
#else
    return "{\"display\":{\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16},"
           "\"theme\":{\"supportsThemeSpecV1\":false,\"maxThemeSpecBytes\":0,\"maxThemePrimitives\":0},"
           "\"transport\":{\"active\":\"usb\",\"supported\":[\"usb\",\"wifi\"]}}";
#endif
  }
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  return "{\"display\":{\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16},"
         "\"theme\":{\"supportsThemeSpecV1\":true,\"maxThemeSpecBytes\":2048,\"maxThemePrimitives\":32,\"supportsStoredThemes\":true,\"maxStoredThemeSpecBytes\":4096},"
         "\"transport\":{\"active\":\"wifi\",\"supported\":[\"usb\",\"wifi\"]}}";
#else
  return "{\"display\":{\"widthPx\":240,\"heightPx\":240,\"colorDepthBits\":16},"
         "\"theme\":{\"supportsThemeSpecV1\":false,\"maxThemeSpecBytes\":0,\"maxThemePrimitives\":0},"
         "\"transport\":{\"active\":\"wifi\",\"supported\":[\"usb\",\"wifi\"]}}";
#endif
#endif
}

codexbar_display::app::TransportConfig makeTransportConfig(const char* activeTransport) {
  codexbar_display::app::TransportConfig config;
  config.boardId = CODEXBAR_DISPLAY_BOARD_ID;
  config.firmwareVersion = CODEXBAR_DISPLAY_FW_VERSION;
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  config.featuresJSON = "[]";
#else
  config.featuresJSON = kThemeFeatureJSON;
#endif
  config.capabilitiesJSON = transportCapabilitiesJSON(activeTransport);
  config.maxFrameBytes = kMaxFrameBytes;
  return config;
}

String htmlEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length());
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '&':
        escaped += "&amp;";
        break;
      case '<':
        escaped += "&lt;";
        break;
      case '>':
        escaped += "&gt;";
        break;
      case '"':
        escaped += "&quot;";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

String macInstallerCommand() {
  return F("curl -fsSL https://github.com/DreamyTalesPAN/CodexBar-Display/releases/latest/download/install.sh | bash");
}

String updateTargetURL() {
  return String("http://") + kMdnsHost;
}

