DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleCaptivePortalProbe() {
  if (setupMode) {
    webServer.send(200, "text/html; charset=utf-8", setupPageHTML());
    return;
  }
  redirectToSetupRoot();
}

void handleSaveWifi() {
  String ssid = webServer.arg("custom_ssid");
  ssid.trim();
  if (ssid.length() == 0) {
    ssid = webServer.arg("ssid");
    ssid.trim();
  }
  String password = webServer.arg("password");
  if (ssid.length() == 0) {
    webServer.send(400, "text/plain; charset=utf-8", "SSID fehlt");
    return;
  }
  if (ssid.length() >= kWifiSsidBytes || password.length() >= kWifiPasswordBytes) {
    webServer.send(400, "text/plain; charset=utf-8", "SSID or password is too long");
    return;
  }

  saveWifiCredentials(ssid, password);
  Serial.printf("wifi_credentials_saved ssid=%s\n", ssid.c_str());
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>Saved. Vibe TV is restarting.</p>");
  delay(500);
  ESP.restart();
}

void handleResetWifi() {
  if (webServer.method() != HTTP_POST) {
    webServer.send(405, "text/plain; charset=utf-8", "method not allowed");
    return;
  }

  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>WiFi settings cleared. Vibe TV is restarting setup.</p>");
  drawWifiResetStatus("Restarting");
  waitStatusRendered = true;
  delay(500);
  clearWifiCredentials();
  clearSdkWifiCredentials();
  clearBootRecoveryCounter();
  delay(250);
  ESP.restart();
}

void addCorsHeaders() {
  webServer.sendHeader("Access-Control-Allow-Origin", "*");
  webServer.sendHeader("Access-Control-Allow-Methods", "GET,POST,DELETE,OPTIONS");
  webServer.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  webServer.sendHeader("Access-Control-Max-Age", "86400");
}

void handleHello() {
  addCorsHeaders();
  webServer.send(200, "application/json", codexbar_display::app::BuildDeviceHelloJSON(makeTransportConfig("wifi")));
}

String wifiModeName() {
  switch (WiFi.getMode()) {
    case WIFI_OFF:
      return "off";
    case WIFI_STA:
      return "station";
    case WIFI_AP:
      return "access_point";
    case WIFI_AP_STA:
      return "ap_station";
    default:
      return "unknown";
  }
}

bool isSafeAssetPath(const String& path) {
  if (path.length() == 0 || path.length() >= kMaxAssetPathBytes || path.charAt(0) != '/') {
    return false;
  }
  if (path.indexOf("..") >= 0 || path.indexOf("//") >= 0) {
    return false;
  }
  if (path.endsWith("/")) {
    return false;
  }
  for (size_t i = 0; i < path.length(); ++i) {
    const char c = path.charAt(i);
    const bool ok =
        (c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '/' || c == '-' || c == '_' || c == '.';
    if (!ok) {
      return false;
    }
  }
  return true;
}

bool ensureAssetParentDirs(const String& path) {
  int slash = path.indexOf('/', 1);
  while (slash > 0) {
    const String dir = path.substring(0, slash);
    if (dir.length() > 1 && !LittleFS.exists(dir)) {
      if (!LittleFS.mkdir(dir)) {
        return false;
      }
    }
    slash = path.indexOf('/', slash + 1);
  }
  return true;
}

bool filesystemInfoJSON(String& out) {
  const bool mounted = LittleFS.begin();

  out += "\"filesystem\":{\"mounted\":";
  out += mounted ? "true" : "false";
  out += "}";
  return mounted;
}

void appendRendererDebugJSON(String& out) {
  const codexbar_display::esp8266::RendererDebugSnapshot snapshot = renderer.DebugSnapshot();
  String activeTheme = snapshot.activeTheme;
  if (snapshot.themeSpecActive && snapshot.themeSpecId.length() > 0) {
    activeTheme = snapshot.themeSpecId;
  }
  out += "\"display\":{\"activeTheme\":\"";
  out += jsonEscape(activeTheme);
  out += "\",\"themeSpec\":{\"active\":";
  out += snapshot.themeSpecActive ? "true" : "false";
  out += ",\"id\":";
  appendJSONNullableString(out, snapshot.themeSpecId);
  out += ",\"rev\":";
  out += String(snapshot.themeSpecRev);
  out += ",\"path\":";
  appendJSONNullableString(out, activeThemeSpecPath);
  out += ",\"hash\":";
  appendJSONNullableString(out, activeThemeSpecHash);
  out += ",\"renderOk\":";
  out += snapshot.themeSpecRenderOk ? "true" : "false";
  out += ",\"renderError\":";
  appendJSONNullableString(out, snapshot.themeSpecRenderError);
  out += ",\"renderFailures\":";
  out += String(snapshot.themeSpecRenderFailures);
  out += ",\"compiled\":";
  out += snapshot.themeSpecCompiled ? "true" : "false";
  out += ",\"primitiveCount\":";
  out += String(snapshot.themeSpecPrimitiveCount);
  out += ",\"primitiveCapacity\":";
  out += String(snapshot.themeSpecPrimitiveCapacity);
  out += ",\"stateAssetCount\":";
  out += String(snapshot.themeSpecStateAssetCount);
  out += ",\"stateAssetCapacity\":";
  out += String(snapshot.themeSpecStateAssetCapacity);
  out += ",\"stringBytes\":";
  out += String(snapshot.themeSpecStringBytes);
  out += ",\"stringCapacity\":";
  out += String(snapshot.themeSpecStringCapacity);
  out += ",\"keepsJsonDocument\":";
  out += snapshot.themeSpecKeepsJsonDocument ? "true" : "false";
  out += ",\"hasAnimatedAssets\":";
  out += snapshot.themeSpecHasAnimatedAssets ? "true" : "false";
  out += "},\"gif\":{\"activePath\":\"";
  out += jsonEscape(snapshot.gifActivePath);
  out += "\",\"filePresent\":";
  out += snapshot.gifFilePresent ? "true" : "false";
  out += ",\"fileOpen\":";
  out += snapshot.gifFileOpen ? "true" : "false";
  out += ",\"decoderOpen\":";
  out += snapshot.gifDecoderOpen ? "true" : "false";
  out += ",\"blocked\":";
  out += snapshot.gifBlocked ? "true" : "false";
  out += ",\"consecutiveFailures\":";
  out += String(snapshot.gifConsecutiveFailures);
  out += ",\"backoffRemainingMs\":";
  out += String(snapshot.gifBackoffRemainingMs);
  out += ",\"lastError\":";
  if (snapshot.gifLastErrorStage.length() == 0) {
    out += "null";
  } else {
    out += "{\"path\":\"";
    out += jsonEscape(snapshot.gifLastErrorPath);
    out += "\",\"stage\":\"";
    out += jsonEscape(snapshot.gifLastErrorStage);
    out += "\",\"failures\":";
    out += String(snapshot.gifLastErrorFailures);
    out += ",\"ageMs\":";
    out += String(snapshot.gifLastErrorAgeMs);
    out += "}";
  }
  out += "}}";
}

