DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void appendFirmwareUpdateJSON(String& out) {
  out += "\"update\":{\"available\":";
  out += firmwareUpdate.available ? "true" : "false";
  out += ",\"latestVersion\":";
  appendJSONNullableString(out, firmwareUpdate.latestVersion);
  out += ",\"manifestUrl\":\"";
  out += jsonEscape(kFirmwareManifestUrl);
  out += "\",\"lastCheckedAtMs\":";
  out += String(firmwareUpdate.lastCheckedAtMs);
  out += ",\"nextCheckAtMs\":";
  out += String(firmwareUpdate.nextCheckAtMs);
  out += ",\"status\":\"";
  out += jsonEscape(firmwareUpdate.lastStatus);
  out += "\",\"lastError\":";
  appendJSONNullableString(out, firmwareUpdate.lastError);
  out += ",\"upload\":{\"target\":\"";
  out += otaDiagnostics.target;
  out += "\",\"status\":\"";
  out += otaDiagnostics.status;
  out += "\",\"filename\":";
  appendJSONNullableString(out, otaDiagnostics.filename);
  out += ",\"command\":";
  out += String(otaDiagnostics.command);
  out += ",\"contentLength\":";
  out += String(otaDiagnostics.contentLength);
  out += ",\"totalSize\":";
  out += String(otaDiagnostics.totalSize);
  out += ",\"maxSize\":";
  out += String(otaDiagnostics.maxSize);
  out += ",\"freeSketchSpace\":";
  out += String(otaDiagnostics.freeSketchSpace);
  out += ",\"updateError\":";
  out += String(otaDiagnostics.updateError);
  out += ",\"lastError\":";
  appendJSONNullableString(out, otaDiagnostics.lastError);
  out += ",\"startedAtMs\":";
  out += String(otaDiagnostics.startedAtMs);
  out += ",\"endedAtMs\":";
  out += String(otaDiagnostics.endedAtMs);
  out += ",\"successCount\":";
  out += String(otaDiagnostics.successCount);
  out += ",\"failureCount\":";
  out += String(otaDiagnostics.failureCount);
  out += "}";
  out += "}";
}

void appendRenderDiagnosticsJSON(String& out) {
  out += "\"render\":{\"fullCount\":";
  out += String(renderDiagnostics.fullCount);
  out += ",\"partialCount\":";
  out += String(renderDiagnostics.partialCount);
  out += ",\"animatedTickAttempts\":";
  out += String(renderDiagnostics.animatedTickAttempts);
  out += ",\"lastKind\":\"";
  out += renderDiagnostics.lastKind;
  out += "\",\"lastDurationUs\":";
  out += String(renderDiagnostics.lastDurationUs);
  out += ",\"lastAtMs\":";
  out += String(renderDiagnostics.lastAtMs);
  out += "}";
}

String normalizedAssetListPath(const String& dirPath, const String& fileName) {
  if (fileName.startsWith("/")) {
    if (dirPath.length() > 1 && !fileName.startsWith(dirPath + "/")) {
      return dirPath + fileName;
    }
    return fileName;
  }
  if (dirPath.length() > 1) {
    return dirPath + "/" + fileName;
  }
  return "/" + fileName;
}

void appendAssetEntriesJSON(String& out, const String& dirPath, bool& first, String& seen, uint8_t depth) {
  if (depth > 4) {
    return;
  }
  Dir dir = LittleFS.openDir(dirPath);
  while (dir.next()) {
    const String path = normalizedAssetListPath(dirPath, dir.fileName());
    if (dir.isDirectory()) {
      appendAssetEntriesJSON(out, path, first, seen, depth + 1);
      continue;
    }
    const String seenToken = "|" + path + "|";
    if (seen.indexOf(seenToken) >= 0) {
      continue;
    }
    seen += seenToken;
    if (!first) {
      out += ",";
    }
    first = false;
    out += "{\"path\":\"";
    out += jsonEscape(path);
    out += "\",\"sizeBytes\":";
    out += String(dir.fileSize());
    out += "}";
  }
}

void appendAssetListJSON(String& out) {
  out += "\"assets\":[";
  bool first = true;
  if (LittleFS.begin()) {
    String seen;
    appendAssetEntriesJSON(out, "/", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes/u", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes/mini", first, seen, 0);
  }
  out += "]";
}

void handleHealth() {
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String out;
  out.reserve(1500);
  out += "{\"ok\":true";
  out += ",\"firmware\":\"";
  out += jsonEscape(CODEXBAR_DISPLAY_FW_VERSION);
  out += "\",\"board\":\"";
  out += jsonEscape(CODEXBAR_DISPLAY_BOARD_ID);
  out += "\",\"system\":{\"freeHeap\":";
  out += String(ESP.getFreeHeap());
  out += ",\"maxFreeBlock\":";
  out += String(ESP.getMaxFreeBlockSize());
  out += ",\"heapFragmentationPct\":";
  out += String(ESP.getHeapFragmentation());
  out += ",\"sketchSize\":";
  out += String(ESP.getSketchSize());
  out += ",\"freeSketchSpace\":";
  out += String(ESP.getFreeSketchSpace());
  out += ",\"sketchMD5\":\"";
  out += jsonEscape(ESP.getSketchMD5());
  out += "\",\"flashChipSize\":";
  out += String(ESP.getFlashChipSize());
  out += ",\"flashChipRealSize\":";
  out += String(ESP.getFlashChipRealSize());
  out += ",\"resetReason\":\"";
  out += jsonEscape(ESP.getResetReason());
  out += "\"";
  out += "},\"wifi\":{\"mode\":\"";
  out += wifiModeName();
  out += "\",\"connected\":";
  out += wifiConnected ? "true" : "false";
  out += ",\"ip\":\"";
  out += wifiConnected ? WiFi.localIP().toString() : "";
  out += "\",\"softApIp\":\"";
  out += (setupMode || WiFi.getMode() == WIFI_AP || WiFi.getMode() == WIFI_AP_STA) ? WiFi.softAPIP().toString() : "";
  out += "\",\"rssi\":";
  out += wifiConnected ? String(WiFi.RSSI()) : "0";
  out += "},";
  const bool filesystemMounted = filesystemInfoJSON(out);
  out += ",";
  appendRendererDebugJSON(out);
  out += ",";
  appendRenderDiagnosticsJSON(out);
  out += ",";
  appendFirmwareUpdateJSON(out);
  out += ",\"transport\":{\"active\":\"wifi\",\"supported\":[\"usb\",\"wifi\"],\"httpPort\":80,\"maxFrameBytes\":";
  out += String(kMaxFrameBytes);
  out += "}}";

  Serial.printf("health_requested ip=%s fs_mounted=%d\n", webServer.client().remoteIP().toString().c_str(), filesystemMounted ? 1 : 0);
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

void handleAssetsList() {
  String out;
  out.reserve(1200);
  out += "{";
  (void)filesystemInfoJSON(out);
  out += ",";
  appendAssetListJSON(out);
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

void setAssetUploadError(const String& message) {
  assetUploadError = message;
  Serial.printf("asset_upload_error path=%s message=%s\n", assetUploadPath.c_str(), assetUploadError.c_str());
}

String requestedAssetPath() {
  String path = webServer.arg("path");
  path.trim();
  if (path.length() == 0) {
    path = webServer.upload().filename;
    path.trim();
    const int lastSlash = path.lastIndexOf('/');
    if (lastSlash >= 0) {
      path = path.substring(lastSlash + 1);
    }
    const int lastBackslash = path.lastIndexOf('\\');
    if (lastBackslash >= 0) {
      path = path.substring(lastBackslash + 1);
    }
    if (path.length() > 0 && !path.startsWith("/")) {
      path = "/" + path;
    }
  }
  return path;
}

